# Dataframe

### tabular data structure composed of a set of ordered columns and rows (a group of Series objects sharing an index)

In [2]:
import pandas as pd

In [7]:
data = {'Year': [2000,2001,2002,2003,2004,2005],
       'Median_age': [25.2,26.4,28.3,27.7,29.0,26.6],
       'Density': [255,256,267,263,269,259]}

In [8]:
data

{'Density': [255, 256, 267, 263, 269, 259],
 'Median_age': [25.2, 26.4, 28.3, 27.7, 29.0, 26.6],
 'Year': [2000, 2001, 2002, 2003, 2004, 2005]}

In [9]:
df1 = pd.DataFrame(data)

In [10]:
df1

   Density  Median_age  Year
0      255        25.2  2000
1      256        26.4  2001
2      267        28.3  2002
3      263        27.7  2003
4      269        29.0  2004
5      259        26.6  2005

In [12]:
df2 = pd.DataFrame(data, columns =['Year','Density','Median_age'])

In [13]:
df2

   Year  Density  Median_age
0  2000      255        25.2
1  2001      256        26.4
2  2002      267        28.3
3  2003      263        27.7
4  2004      269        29.0
5  2005      259        26.6

In [16]:
df3 = pd.DataFrame([
    ['Peter',19,'student','TN','M',None],
    ['Mary',20,'lawyer','SG','F',None],
    ['John',21,'teacher','SG','M',None],
    ['Bobby',22,'nurse','HN','M',None]],
    columns =['name','age','career','province','gender','award'])

In [17]:
df3

    name  age   career province gender award
0  Peter   19  student       TN      M  None
1   Mary   20   lawyer       SG      F  None
2   John   21  teacher       SG      M  None
3  Bobby   22    nurse       HN      M  None

In [18]:
df3.name

0    Peter
1     Mary
2     John
3    Bobby
Name: name, dtype: object

In [19]:
df3['award'] = 0

In [20]:
df3

    name  age   career province gender  award
0  Peter   19  student       TN      M      0
1   Mary   20   lawyer       SG      F      0
2   John   21  teacher       SG      M      0
3  Bobby   22    nurse       HN      M      0

In [21]:
df3.ix[0] # gives the first row

name          Peter
age              19
career      student
province         TN
gender            M
award             0
Name: 0, dtype: object